{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.9.0",
  "convertedBy": "user",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_model",
      "layers": []
    }
  },
  "weightsManifest": []
}
